# OpacityByClassN

## Description
```pascal
PROCEDURE OpacityByClassN(
				fillOpacityByClass : BOOLEAN;
				penOpacityByClass  : BOOLEAN);
```

```python

def vs.OpacityByClassN(fillOpacityByClass, penOpacityByClass):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fillOpacityByClass|BOOLEAN||
|penOpacityByClass|BOOLEAN||

## Version
Availability: from Vectorworks 2017
## Category
* Classes